'''
Python Pro
#Homework 6 (18.12.2022)

1. Створіть клас «Прямокутник», у якого є два поля (ширина і висота). Реалізуйте метод порівняння прямокутників
за площею.

Також реалізуйте методи складання прямокутників (площа сумарного прямокутника повинна дорівнювати сумі площ
прямокутників, які ви складаєте).
Реалізуйте методи множення прямокутника на число n (це має збільшити площу базового прямокутника в n разів).

2. Створіть клас «Правильна дроба» та реалізуйте методи порівняння, додавання, віднімання та множення для екземплярів
 цього класу.


1. Доповніть клас Група (завдання Лекції 2) можливістю підтримки ітераційного протоколу.
2. Модифікуєте клас Замовлення (завдання Лекції 1), додавши реалізацію протоколу послідовностей та ітераційного
протоколу.

'''